app/controllers/answers_controller.rb

INSERT INTO "answers" ("answer", "question_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["answer", "adfasdg"], ["question_id", 3], ["user_id", 2], ["created_at", "2015-06-23 18:10:07.927334"], ["updated_at", "2015-06-23 18:10:07.927334"]]
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = $1 LIMIT 1  [["question_id", 3]]
---
  def create
    @answer = Answer.new(answer_params)
    if @answer.save
      flash[:notice] = "Answer submitted."
      redirect_to @answer.question
    else
      flash[:error] = @answer.errors.full_messages.join(". ")