app/controllers/questions_controller.rb

  def update
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]