app/controllers/questions_controller.rb

  def index
    @questions = Question.all.sort.reverse
---
SELECT  "questions".* FROM "questions"  ORDER BY "questions"."id" ASC LIMIT 1

  def create
    @question = Question.new(question_params)
    if @question.save
---
INSERT INTO "questions" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
    @question = Question.find(params[:id])
    @answers = Answer.where(question_id: @question.id)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = $1 LIMIT 1  [["question_id", 3]]